DunningLetters/DunningLetters/Files/NS_FU/Fusion/Customer/CreateAccount/Request/CreateCustomerAccount.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/" xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/" xmlns:ns9="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/" xmlns:ns8="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/" xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:ns7="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:createCustomerAccount>
			<ns1:customerAccount>
				<ns2:PartyId>300000007806548</ns2:PartyId>
				<ns2:AccountNumber>301010_1</ns2:AccountNumber>
				<ns2:CustomerClassCode>PUBLIC SECTOR COMPANIES</ns2:CustomerClassCode>
				<ns2:AccountName>301010_1</ns2:AccountName>
				<ns2:AccountEstablishedDate>2021-03-28</ns2:AccountEstablishedDate>
				<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
				<ns2:CustomerAccountSite>
					<ns2:PartySiteId>300000007806550</ns2:PartySiteId>
					<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
					<ns2:SetId>300000000003311</ns2:SetId>
					<ns2:StartDate>2021-03-28</ns2:StartDate>
					<ns2:CustomerAccountSiteUse>
						<ns2:SiteUseCode>BILL_TO</ns2:SiteUseCode>
						<ns2:StartDate>2021-03-28</ns2:StartDate>
						<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
						 <ns2:OriginalSystemReference xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
							<ns4:OrigSystem>SIS</ns4:OrigSystem>
							<ns4:OrigSystemReference>300000007806552</ns4:OrigSystemReference>
							<ns4:OwnerTableName>HZ_CUST_SITE_USES_ALL</ns4:OwnerTableName>
							<ns4:CreatedByModule>SIS</ns4:CreatedByModule>
						</ns2:OriginalSystemReference>
					</ns2:CustomerAccountSiteUse>
					<ns2:OriginalSystemReference>
						<ns4:OrigSystem>SIS</ns4:OrigSystem>
						<ns4:OrigSystemReference>300000007806550</ns4:OrigSystemReference>
						<ns4:OwnerTableName>HZ_CUST_ACCT_SITES_ALL</ns4:OwnerTableName>
						<ns4:CreatedByModule>SIS</ns4:CreatedByModule>
					</ns2:OriginalSystemReference>
				</ns2:CustomerAccountSite>
				<ns2:OriginalSystemReference>
					<ns4:OrigSystem>SIS</ns4:OrigSystem>
					<ns4:OrigSystemReference>300000007806548</ns4:OrigSystemReference>
					<ns4:OwnerTableName>HZ_CUST_ACCOUNTS</ns4:OwnerTableName>
					<ns4:CreatedByModule>SIS</ns4:CreatedByModule>
				</ns2:OriginalSystemReference>
				<ns2:CustAcctInformation>
					<ns8:cinNum>1</ns8:cinNum>
					<ns8:customerProvidedCode>.</ns8:customerProvidedCode>
					   <ns8:customerGroup>TestingGroup22</ns8:customerGroup>
					   <ns8:customerGroupCode>999</ns8:customerGroupCode>
					   <ns8:customerGrandParent>TestingParent0122</ns8:customerGrandParent>
					   <ns8:customerGrandParentCode>999</ns8:customerGrandParentCode>
					<ns8:wthTaxCode>194C - Payment of Co</ns8:wthTaxCode>
					<ns8:defaultTdsRate>2%</ns8:defaultTdsRate>
					<ns8:concessional>Yes</ns8:concessional>
					<ns8:validityPeriod>28/04/2021</ns8:validityPeriod>
					<ns8:thresholdLimit>300000</ns8:thresholdLimit>
					<ns8:virtualAccountNum>.</ns8:virtualAccountNum>
					<ns8:salesRep>1</ns8:salesRep>
					<ns8:warehouse>1</ns8:warehouse>
					<ns8:marketing>1</ns8:marketing>
					<ns8:paymentTerms>10 days</ns8:paymentTerms>
					<ns8:suppressReminder>N</ns8:suppressReminder>
					<ns8:suppressStatement>N</ns8:suppressStatement>
					<ns8:acquiredFrom></ns8:acquiredFrom>
					<ns8:invoiceType>Paper</ns8:invoiceType>
				</ns2:CustAcctInformation>
			</ns1:customerAccount>
		</ns1:createCustomerAccount>
	</soap:Body>
</soap:Envelope>

