CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/Customer/CreateAccount/Request/CreateCustomerAccount_OLD.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/">
      <ns1:createCustomerAccount>
         <ns1:customerAccount xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/">
			<ns2:RequestId>300000001771253</ns2:RequestId>
            <ns2:PartyId>300000001771253</ns2:PartyId>
            <ns2:AccountNumber>TestAccount</ns2:AccountNumber>
            <ns2:CustomerClassCode>PUBLIC SECTOR COMPANIES</ns2:CustomerClassCode>
            <ns2:AccountName>TestAccount</ns2:AccountName>
            <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
            <ns2:CustomerAccountSite>
               <ns2:PartySiteId>300000001771254</ns2:PartySiteId>
               <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
               <ns2:SetId>300000000003311</ns2:SetId>
               <ns2:StartDateActive>2020-09-25</ns2:StartDateActive>
               <ns2:CustomerAccountSiteUse>
                  <ns2:SiteUseCode>BILL_TO</ns2:SiteUseCode>
                  <ns2:StartDate>2020-09-25</ns2:StartDate>
                  <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
                  <ns2:OriginalSystemReference xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
                     <ns4:OrigSystem>SIS</ns4:OrigSystem>
                     <ns4:OrigSystemReference>300000001771255</ns4:OrigSystemReference>
                     <ns4:OwnerTableName>HZ_CUST_SITE_USES_ALL</ns4:OwnerTableName>
                     <ns4:CreatedByModule>SIS</ns4:CreatedByModule>
                  </ns2:OriginalSystemReference>
               </ns2:CustomerAccountSiteUse>
               <ns2:CustomerAccountSiteUse>
                  <ns2:SiteUseCode>SHIP_TO</ns2:SiteUseCode>
                  <ns2:StartDate>2020-09-25</ns2:StartDate>
                  <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
                  <ns2:OriginalSystemReference xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
                     <ns4:OrigSystem>SIS</ns4:OrigSystem>
                     <ns4:OrigSystemReference>300000001771256</ns4:OrigSystemReference>
                     <ns4:OwnerTableName>HZ_CUST_SITE_USES_ALL</ns4:OwnerTableName>
                     <ns4:CreatedByModule>SIS</ns4:CreatedByModule>
                  </ns2:OriginalSystemReference>
               </ns2:CustomerAccountSiteUse>
               <ns2:OriginalSystemReference xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
                  <ns6:OrigSystem>SIS</ns6:OrigSystem>
                  <ns6:OrigSystemReference>300000001771254</ns6:OrigSystemReference>
                  <ns6:OwnerTableName>HZ_CUST_ACCT_SITES_ALL</ns6:OwnerTableName>
                  <ns6:CreatedByModule>SIS</ns6:CreatedByModule>
               </ns2:OriginalSystemReference>
            </ns2:CustomerAccountSite>
            <ns2:CustomerAccountSite>
               <ns2:PartySiteId>300000001771257</ns2:PartySiteId>
               <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
               <ns2:SetId>300000000003311</ns2:SetId>
               <ns2:StartDateActive>2020-09-25</ns2:StartDateActive>
               <ns2:CustomerAccountSiteUse>
                  <ns2:SiteUseCode>BILL_TO</ns2:SiteUseCode>
                  <ns2:StartDate>2020-09-25</ns2:StartDate>
                  <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
                  <ns2:OriginalSystemReference xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
                     <ns4:OrigSystem>SIS</ns4:OrigSystem>
                     <ns4:OrigSystemReference>300000001771258</ns4:OrigSystemReference>
                     <ns4:OwnerTableName>HZ_CUST_SITE_USES_ALL</ns4:OwnerTableName>
                     <ns4:CreatedByModule>SIS</ns4:CreatedByModule>
                  </ns2:OriginalSystemReference>
               </ns2:CustomerAccountSiteUse>
               <ns2:CustomerAccountSiteUse>
                  <ns2:SiteUseCode>SHIP_TO</ns2:SiteUseCode>
                  <ns2:StartDate>2020-09-25</ns2:StartDate>
                  <ns2:CreatedByModule>SIS</ns2:CreatedByModule>
                  <ns2:OriginalSystemReference xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
                     <ns4:OrigSystem>SIS</ns4:OrigSystem>
                     <ns4:OrigSystemReference>300000001771259</ns4:OrigSystemReference>
                     <ns4:OwnerTableName>HZ_CUST_SITE_USES_ALL</ns4:OwnerTableName>
                     <ns4:CreatedByModule>SIS</ns4:CreatedByModule>
                  </ns2:OriginalSystemReference>
               </ns2:CustomerAccountSiteUse>
               <ns2:OriginalSystemReference xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
                  <ns6:OrigSystem>SIS</ns6:OrigSystem>
                  <ns6:OrigSystemReference>300000001771257</ns6:OrigSystemReference>
                  <ns6:OwnerTableName>HZ_CUST_ACCT_SITES_ALL</ns6:OwnerTableName>
                  <ns6:CreatedByModule>SIS</ns6:CreatedByModule>
               </ns2:OriginalSystemReference>
            </ns2:CustomerAccountSite>
            <ns2:OriginalSystemReference xmlns:ns7="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
               <ns7:OrigSystem>SIS</ns7:OrigSystem>
               <ns7:OrigSystemReference>300000001771253</ns7:OrigSystemReference>
               <ns7:OwnerTableName>HZ_CUST_ACCOUNTS</ns7:OwnerTableName>
               <ns7:CreatedByModule>SIS</ns7:CreatedByModule>
            </ns2:OriginalSystemReference>
	    <ns2:CustAcctInformation xmlns:ns8="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/">
               <ns8:cinNum/>
               <ns8:customerProvidedCode/>
               <ns8:customerGroup>TestGroup</ns8:customerGroup>
               <ns8:wthTaxCode/>
               <ns8:defaultTdsRate/>
               <ns8:concessional/>
               <ns8:validityPeriod/>
               <ns8:thresholdLimit/>
               <ns8:virtualAccountNum/>
               <ns8:salesRep>TestSalesRep</ns8:salesRep>
               <ns8:warehouse>1</ns8:warehouse>
               <ns8:marketing>1</ns8:marketing>
            </ns2:CustAcctInformation>
         </ns1:customerAccount>
      </ns1:createCustomerAccount>
   </soap:Body>
</soap:Envelope>